Revit 2024 API
CentralFileCommunicationException Class
The exception thrown when there is a network communication error involving a file-based central model.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
[SerializableAttribute]
public class CentralFileCommunicationException : CentralModelException
Visual Basic
<SerializableAttribute> _
Public Class CentralFileCommunicationException _
	Inherits CentralModelException
Visual C++
[SerializableAttribute]
public ref class CentralFileCommunicationException : public CentralModelException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.CentralModelException
 Autodesk.Revit.Exceptions.CentralFileCommunicationException
See Also
CentralFileCommunicationException Members
Autodesk.Revit.Exceptions Namespace